#include<iostream>
#include<Windows.h>
#include<iomanip>

#include"Func.h"

using namespace std;

int main()
{
	SetConsoleCP(65001);
	SetConsoleOutputCP(65001);
	srand(time(0));

	//  I
	cout << "\tI" << endl;
	// Дано два масиви: А[M] і B[N] (M і N вводяться з клавіатури).
	// Необхідно створити третій масив мінімально можливого розміру,
	// у якому потрібно зібрати елементи масиву A,
	// що не включаються в масив B, без повторень.




	//  II
	cout << "\n\tII" << endl;
	// Дано два масиви: А[M] і B[N] (M і N вводяться з клавіатури).
	// Необхідно створити третій масив мінімально можливого розміру,
	// в якому потрібно зібрати елементи масивів A і B,
	// які не є спільними для них, без повторень.




	return 0;
}