#include<iostream>
#include<Windows.h>
#include<iomanip>

#include"Func.h"

using namespace std;

int main()
{
	SetConsoleCP(65001);
	SetConsoleOutputCP(65001);
	SetColor(White, Black);
	system("cls");
	srand(time(0));


	//  I
	cout << "\tI" << endl;
	// Написати такі функції для роботи з динамічним масивом:
	// - Функція розподілу динамічної пам'яті.
	// - Функція ініціалізації динамічного масиву.
	// - Функція друку динамічного масиву.
	// - Функція видалення динамічного масиву.
	// - Функція додавання елемента в кінець масиву.
	// - Функція вставки елемента за вказаним індексом.
	// - Функція видалення елемента за вказаним індексом.




	//  II
	cout << "\n\tII" << endl;
	// Написати функцію, яка отримує покажчик на динамічний масив і
	// його розмір. Функція повинна видалити з масиву всі прості числа
	// і повернути покажчик на новий динамічний масив.




	//  III
	cout << "\n\tIII" << endl;
	// Написати функцію, яка отримує покажчик на статичний масив і
	// його розмір. Функція розподіляє додатні, від'ємні та нульові
	// елементи в окремі динамічні масиви.




	return 0;
}