#include<iostream>
#include<Windows.h>
#include<iomanip>

#include"Func.h"

using namespace std;

int main()
{
	SetConsoleCP(65001);
	SetConsoleOutputCP(65001);
	SetColor(White, Black);
	system("cls");
	srand(time(0));

	// Написати програму, яка містить функцію Action, що приймає як аргумент
	// покажчики на два масиви (А і В) і розміри масивів, а також покажчик на функцію.
	// Користувачеві відображається меню, в якому він може вибрати max, min, avg. 
	// Якщо обрано max, передається покажчик на функцію, яка шукає максимум; 
	// якщо обрано min, передається покажчик на функцію, яка шукає мінімум; 
	// якщо обрано avg, передається покажчик на функцію, яка шукає середнє.
	// Повернуте значення функції Action — результат вибору користувача max, min, avg.


	

	return 0;
}